{
  "Amazon": [
    {
      "Url": "https://www.amazon.com/dp/B07XM8GDWC",
      "Title": "OnePlus Nord N100 Midnight Frost Unlocked Smartphone​, 4GB+64GB, US Version, Model BE2011",
      "Price": "$179.99",
      "SellerName": null,
      "Description": "OnePlus Nord N100 comes with a big display, big battery, and big storage at an affordable price. It sports a 6.52” immersive display with the power of dual stereo speakers. For long battery life, OnePlus Nord 100 is powered by a 5000mAh battery and supports 18W fast charge. It also comes with 4GB of RAM with 64 GB of storage.",
      "ProductShipping": "$90.08 Shipping",
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08KVMHH6L",
      "Title": "OnePlus 8T Lunar Silver, 5G Unlocked Android Smartphone U.S. Version, 256GB Storage + 12GB RAM, 120Hz Fluid Display, Quad Camera",
      "Price": "$599.99",
      "SellerName": null,
      "Description": "5G Unlocked Android Smartphone U.S Version, 12GB RAM+256GB Storage, 120Hz Fluid Display,Quad Camera, 65W Ultra Fast Charge, Lunar Silver, U.S Warranty",
      "ProductShipping": "$272.25 Shipping",
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08R6H1J5R",
      "Title": "OnePlus Nord N10 5G (128GB, 6GB) 6.49\", 90Hz Refresh Rate, Snapdragon 690, Dual SIM (Euro 5G /Global 4G LTE) GSM Unlocked (T-Mobile, AT&amp;T, Metro) International Model (Midnight Ice, 64GB SD Bundle)",
      "Price": "$271.98",
      "SellerName": null,
      "Description": "Play it smooth with 90 Hz The N10 5G display refreshes 50% faster than standard 60 Hz displays, making it more responsive and smoother. Swipe and scroll with an upgraded viewing experience on the new N10 5G. 5G vs 4G? It's not even a fair fight. It’s finally time to upgrade to the next chapter of mobile technology – 5G. The N10 5G packs a powerful punch, featuring a Qualcomm Snapdragon 690 chipset powered by an octa-core CPU, enabling you to reach powerful 5G speeds. Sound coming at you left and right. The N10 5G takes sound seriously. Dual speakers produce an immersive stereo audio experience, allowing you to enjoy your favorite content. A picture is worth a thousand words. And also millions of pixels. The N10 5G has a 64 MP main camera, and three others that capture stunning details. Switch between a 119° ultra-wide, macro, and monochrome lens.",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08Y727NMK",
      "Title": "OnePlus 9 Winter Mist, 5G Unlocked Android Smartphone U.S Version, 8GB RAM+128GB Storage, 120Hz Fluid Display, Hasselblad Triple Camera, 65W Ultra Fast Charge, 15W Wireless Charge, with Alexa Built-in",
      "Price": "$686.91",
      "SellerName": null,
      "Description": "5G Unlocked Android Smartphone U.S Version, 8GB RAM+128GB Storage, 120Hz Fluid Display, Hasselblad Quad Camera, 65W Ultra Fast Charge, Winter Mist, U.S Warranty",
      "ProductShipping": "$308.82 Shipping",
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B09288MYN2",
      "Title": "OnePlus 9 5G (128GB, 8GB) 6.55\" 120Hz Fluid AMOLED, Snapdragon 888, Global 5G Volte (GSM + CDMA) Factory Unlocked (AT&amp;T, Verizon, T-Mobile, Metro) LE2115 (Fast Car Charger Bundle, Winter Mist)",
      "Price": "",
      "SellerName": null,
      "Description": "120 Hz Fluid Display: The OnePlus 9's 6.55\" Fluid AMOLED Display11 offers ultra-smooth scrolling in every frame. With a 120 Hz panel, our best ever flat display delivers a flagship visual experience. Delivering enhanced color accuracy and detail, all eyes are on the OnePlus 9. So, So Smooth: Co-created with our extraordinary OnePlus community, the popular OxygenOS 11 personifies our Never Settle vision. Introducing new features and a refreshed UI, we've dialed everything up to 11. More intuitive and immersive, experience our fastest, smoothest ever OS. Hasselblad Camera for Mobile: A OnePlus-exclusive and co-developed with Hasselblad, the flagship Hasselblad Camera for Mobile delivers industry-leading mobile photography innovations. Designed for every situation, effortlessly craft unforgettable scenes with the world as your canvas. With the OnePlus 9, Your Best Shot has arrived. Engineered for Speed: The signature OnePlus ‘Fast and Smooth’ experience personifies our Never Settle spirit. With our fastest ever 5G, ultra-powerful Snapdragon 888 CPU, and next-gen RAM, uncompromising power has arrived. Experience the next level of fast and smooth with the OnePlus 9.",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08723GJ2T",
      "Title": "OnePlus 8 Pro Ultramarine Blue, 5G Unlocked Android Smartphone U.S Version, 12GB RAM+256GB Storage, 120Hz Fluid Display,Quad Camera, Wireless Charge, with Alexa Built-in",
      "Price": "$849.99",
      "SellerName": null,
      "Description": "OnePlus 8 Pro - Lead with Speed | 120 Hz Fluid Display – Incredibly responsive with sensational color accuracy. | High-capacity 4510mAh battery – Speed up your charge with Warp Charge 30T + Warp Charge 30 Wireless with reverse wireless charging | 48 MP Quad Camera – Find your frame with a 48 MP main camera, 48 MP ultra wide angle camera, 3X telephoto lens with up to 30X Digital Zoom, and Color Filter Camera | 12 GB RAM + 256 GB Storage –Qualcomm® Snapdragon™ 865 sets a new benchmark for performance. Featuring 5G connectivity.",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B07XY7XG5N",
      "Title": "OnePlus Nord N100 (64GB, 4GB) 6.52\" 90Hz Display, Snapdragon, 5000mAh, Dual SIM GSM Unlocked Global 4G LTE (T-Mobile, AT&amp;T, Metro, Straight Talk) International Model (Midnight Frost, 64GB SD Bundle)",
      "Price": "$172.44",
      "SellerName": null,
      "Description": "Life is too short for small screens.What you watch these days is just as important as where you watch it. Actually, that’s always been important. For the N100, we stretched the screen to 6.52\" to give your movies, games, and apps the screen estate they deserve. When you got a big screen, you expect big sound.The N100 rocks a set of powerful dual speakers for a more immersive audio experience. So whether you're watching your favorite series or that new movie you've been waiting to see, every moment sounds richer and fuller. A camera system that stacks up.The first step to taking great photos is having the right tools. The N100 comes prepared with a 13 MP main camera for stunning shots, a macro lens for getting up close and personal, and a specialized camera for portrait photos. The power to stop worrying about power.Running around trying to find an outlet as your phone hangs on at 1% is never fun. That's why we powered the N100 with a long-lasting 5,000 mAh battery and included an 18W fast charger to make sure it stays powered. Plenty of space to play. Or work. But preferably play.The N100 keeps it 100. 4 GB of RAM helps you zip from streaming to messaging apps to calling the pizza guy to see where your order is, while 64 GB of storage offers lots of space for all your favorite content.",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08R6H98QC",
      "Title": "OnePlus 8 5G UW (128GB, 8GB) 6.55\" 90Hz AMOLED, Snapdragon 865, Volte (GSM+CDMA) Verizon Unlocked (T-Mobile, AT&amp;T, Metro) IN2019 w/Fast Car Charger (Onyx Black)",
      "Price": "$474.95",
      "SellerName": null,
      "Description": "A sleek, durable design makes the OnePlus 8 5G UW the perfect companion to your active life. Built with precision and durability, this is one smartphone that’s engineered to be your everyday companion. And with an IP68 water resistance rating,4more information in footnotes you won’t have to worry about getting caught in the rain or splashed at the pool. Available in Onyx Black &amp; Polar Silver. Don’t let lag slow you down. With a 90 Hz refresh rate, you can swipe, scroll, and game with increased responsiveness. The borderless Fluid Display is designed to keep you at the top of your game, with true-to-life colors and HDR10+3more information in footnotes for a truly dynamic viewing experience. Ditch the DSLR and capture every moment in real-time with any of the OnePlus 8 5G UW’s 3 rear cameras. Shoot photos and videos, even when your subject is on the go or in low light conditions. And for those who love a good selfie, you can easily shoot and share with the 16 MP front-facing camera.",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B085J1CPD1",
      "Title": "OnePlus 8T 5G KB2000 256GB 12GB RAM International Version - Lunar Silver",
      "Price": "$571.90",
      "SellerName": null,
      "Description": "p></p><p>OnePlus 8T 5G KB2000 256GB 12GB RAM International Version - Lunar Silver</p><p><br></p><p>Capture and display vivid, realistic, and accurate visuals with the&nbsp;OnePlus 8T 5G Smartphone. Featuring a quad rear camera system, you can snap very hi-res 48MP wide-angle shots without blur, thanks to both OIS (Optical Image Stabilization) and EIS (Electronic Image Stabilization) technology. Rounding out the 8T's mobile photo capabilities is a 16MP ultra-wide with 117° FOV (Field of View), a 5MP macro for detailed close-ups, and a 2MP monochrome lens. On the front is a 16MP camera for taking selfies.<br></p>\n\n<p>",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08XX4P7LB",
      "Title": "Samsung Galaxy A52 5G, Factory Unlocked Smartphone, Android Cell Phone, Water Resistant, 64MP Camera, US Version, 128GB, Black",
      "Price": "$499.99",
      "SellerName": null,
      "Description": "We’ve curated some of our most awesome Galaxy features and packed them into a stylish and affordable package. Meet Samsung Galaxy A52 5G, a cell phone that's ready for anything. Pro-grade, multi-lens camera system to capture all the action? Check. Stunningly vivid Infinity-O Full HD+ display to make your gameplay pop? You got it. 5G connectivity, super-fast processing power, long-lasting battery and a bold, water-resistant design? Oh yeah. Because awesome is for everyone. Requires optimal 5G network connection, available in select markets. Check with your carrier for availability and details. Download and streaming speeds may vary based on content provider, server connection, and other factors. Galaxy A52 5G is rated as IP67. Based on test conditions for submersion in up to 3 feet of freshwater for up to 30 minutes. Not advised for beach or pool use.",
      "ProductShipping": "$225.05 Shipping",
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08L4JVGQ1",
      "Title": "OnePlus Nord 5G AC2003 128GB 8GB RAM Factory Unlocked (GSM Only | No CDMA - not Compatible with Verizon/Sprint) International Version - Onyx Gray",
      "Price": "$427.95",
      "SellerName": null,
      "Description": "<!",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08K9YT25X",
      "Title": "OnePlus Buds Z - True Wireless in-Ear Earbuds with Charging Case, White – Fast Charging, Deep Bass, Comfortable and Lightweight, IP55",
      "Price": "$44.51",
      "SellerName": null,
      "Description": "True Wireless Earbuds with Charging Case, Fast Charging, Long Battery Life and Deep Bass, comfortable,lightweight and stable fit.",
      "ProductShipping": "$27.32 Shipping",
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B089MS8SKL",
      "Title": "OnePlus 9 Pro 5G LE2120 256GB 12GB Factory Unlocked (GSM Only | No CDMA - not Compatible with Verizon/Sprint) China Version - Forest Green",
      "Price": "$955.00",
      "SellerName": null,
      "Description": "Hasselblad Camera for Mobile. Co-developed with Hasselblad, the exclusive Hasselblad Camera for Mobile delivers multiple breakthroughs including Natural Color Calibration. The ultra-flagship camera blends the technological excellence of OnePlus and the legacy of Hasselblad. With the OnePlus 9 Pro, taking Your Best Shot is now effortless. NOTE: Compatible with most GSM carriers and will NOT work with CDMA carriers. Storage: 256GB 12GB RAM Display: 6.7” LTPO Fluid2 AMOLED, 1B colors, 120Hz, HDR10+, 1300 nits, Corning Gorilla Glass 5, Always-on display Platform: Android 11, OxygenOS 11.3., Qualcomm SM8350 Snapdragon 888 5G, Octa-core, Adreno 660 Camera: 48MP + 8MP + 50MP + 2MP ; Hasselblad Color Calibration, dual-LED flash, HDR, panorama Battery: Li-Po 4500 mAh, non-removable Features: Fingerprint (under display, optical), accelerometer, gyro, proximity, compass, color spectrum",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B089MVKH71",
      "Title": "OnePlus 9 Pro 5G LE2120 256GB 12GB RAM Factory Unlocked (GSM Only | No CDMA - not Compatible with Verizon/Sprint) China Version – Stellar Black",
      "Price": "$945.00",
      "SellerName": null,
      "Description": "Hasselblad Camera for Mobile. Co-developed with Hasselblad, the exclusive Hasselblad Camera for Mobile delivers multiple breakthroughs including Natural Color Calibration. The ultra-flagship camera blends the technological excellence of OnePlus and the legacy of Hasselblad. With the OnePlus 9 Pro, taking Your Best Shot is now effortless. NOTE: Compatible with most GSM carriers and will NOT work with CDMA carriers. Storage: 256GB 12GB RAM Display: 6.7” LTPO Fluid2 AMOLED, 1B colors, 120Hz, HDR10+, 1300 nits, Corning Gorilla Glass 5, Always-on display Platform: Android 11, OxygenOS 11.3., Qualcomm SM8350 Snapdragon 888 5G, Octa-core, Adreno 660 Camera: 48MP + 8MP + 50MP + 2MP ; Hasselblad Color Calibration, dual-LED flash, HDR, panorama Battery: Li-Po 4500 mAh, non-removable Features: Fingerprint (under display, optical), accelerometer, gyro, proximity, compass, color spectrum",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B087LYQ22N",
      "Title": "TCL 10L, Unlocked Android Smartphone with 6.53\" FHD + LCD Display, 48MP Quad Rear Camera System, 64GB+6GB RAM, 4000mAh Battery",
      "Price": "$249.99",
      "SellerName": null,
      "Description": null,
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B092S8CNJ4",
      "Title": "for Oneplus 8T Back Glass Cover Replacement with Camera Glass Lens/Flash for OnePlus 8T 5G KB2000 KB2005 (Green)",
      "Price": "$22.99",
      "SellerName": null,
      "Description": "<b>Color:Green</b><br> <br> <b> Rear Panel Glass,Back Cover Full Housing Assembly Replacement Parts </b><br> <br> <b>Camera Lens Cover For Oneplus 8T </b><br> <br> <b>Features:</b><br> <br> <b>Brand New A Quality Rear Panel Housing case Glass Oneplus 8T </b><br> <br> <b>Quality material, premium craftsmanship. </b><br> <br> <b>100% Perfect fit. </b><br> <br> <b>Replace your Oneplus 8T broken, damaged or cracked back cover glass with this new one. </b><br> <br> <br>",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B087H7X29D",
      "Title": "OnePlus 8 iN2010 128GB 8GB RAM International Version- Glacial Green",
      "Price": "$525.00",
      "SellerName": null,
      "Description": "p></p><p>The OnePlus 8 sports a 90Hz screen with 6.55 inches and an elevated viewing experience, vivid colors, vibrant details and HDR10+ support. The 90 Hz refresh rate of the OnePlus 8 allows you to swipe, scroll, and navigate with ease. The brilliant FHD+ display has a resolution of 2400 x 1080 pixels and 402ppi. The OP8 comes with an aspect ratio of 20:9 and the cover glass is 3D Corning Gorilla Glass for the best possible protection. Additional features of the display include Vibrant Color Effect, Reading Mode and Night Mode. The OnePlus 8 has an A+ rating from DisplayMate and an SGS Eye Care Display Certification. in addition, the brand new OnePlus 8 comes with dual 5G support and is powered by the high-end Qualcomm Snapdragon 865 including a X55 5G modem, DDR4x RAM and UFS3.0 internal storage standard up to 256GB.</p><p>Pre Sale Estimated Ship Date April 25th 2020<br></p>\n\n<p>",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08GL37KXS",
      "Title": "OnePlus 7T Pro 5G McLaren Edition US Model HD1925 12GB RAM 256GB ROM T-Mobile Unlocked Single SIM",
      "Price": "",
      "SellerName": null,
      "Description": "Compatible with T-Mobile and unlocked for all GSM networks such as AT&amp;T, Cricket, and Metro PCS. May have limited compatibility with Verizon and Sprint, compatibility not guaranteed. Comes with Fast Wall Charger, Data Cable, and SIM removal tool. Basic Parameters: Dimensions: 162.6×75.9×8.8mm Weight: 210g Back Material: 3D Corning Gorilla Glass Color: Papaya Orange Operating System: OxygenOS based on Android 10 Processor: Qualcomm Snapdragon 855 Plus (Octa-core, 7nm, up to 2.96 GHz) , with Qualcomm AI Engine GPU: Adreno 640 RAM: 12GB LPDDR4X Storage: 256GB UFS 3.0 2-LANE Sensors: In-display Fingerprint Sensor, Accelerometer, Electronic Compass, Gyroscope, Ambient Light Sensor, Proximity Sensor, Sensor Core, Laser Sensor Ports: USB 3.1 GEN1, Type-C, Support standard Type-C earphone Single nano-SIM slot Battery: 4085 mAh (non-removable) Warp Charge 30T Fast Charging (5V/6A)",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B08Q3C9B79",
      "Title": "KEZiHOME Oneplus 8T 5G Case, Genuine Leather Oneplus 8T Wallet Case Flip Magnetic Protective Cover [RFID Blocking] with Card Slot Stand Phone Case Compatible with Oneplus 8T (Black/Brown)",
      "Price": "$29.99",
      "SellerName": null,
      "Description": null,
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B07K76LBLZ",
      "Title": "OnePlus 6T A6013 128GB Storage + 8GB Memory T-Mobile and GSM + Verizon Unlocked 6.41 inch AMOLED Display Android 9 - Mirror Black US Version",
      "Price": "$299.99",
      "SellerName": null,
      "Description": "Unlock your OnePlus 6T with the fastest in-display fingerprint sensor on any smartphone. We are setting a new industry standard with our cutting-edge Screen Unlock technology. Dual Camera with image stabilization shoot clearer photos and optimized for low-light and portrait photography. Our highly rated 16 + 20 MP cameras both with f/1.7 aperture help you capture crystal-clear shots. Design Expand your perspective Leap into a truly immersive flagship experience. Our Full Optic 6.41 inch AMOLED 19:9 display complements the masterfully crafted body for a sleek, yet resilient design. OxygenOS Software based on Android 9.0 is so smooth, you’ll notice the difference The best of Android refined. OxygenOS is streamlined with feedback from our users for a refreshing user experience. Performance Packed with incredible power and speed Your experience with Qualcomm Snapdragon 845 optimized, thanks to a seamless combination of hardware and software. Dash Charge Probably the best charging solution on the planet A day’s power in half an hour. Dash Charge, our signature powering solution, is the end of overnight charging. Network Move with freedom Ready to take on the world. This is the Tmobile USA A6013 Unlocked Model and is Single SIM",
      "ProductShipping": null,
      "offers": null
    },
    {
      "Url": "https://www.amazon.com/dp/B09375CHKN",
      "Title": "UMIDIGI Bison Rugged Unlocked Cell Phones 8+128GB, IP68 &amp; IP69K Rating Waterproof and Dustproof Smartphone, 6.3\" FHD+ Full Screen Cell Phone with 5000mAh Battery and 48MP Quad Camera",
      "Price": "",
      "SellerName": null,
      "Description": null,
      "ProductShipping": null,
      "offers": null
    }
  ]
}